#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-9Pv3oyThkDRqdXea

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem              = (sensitive value)
      + certificate_domain           = (known after apply)
      + certificate_p12              = (sensitive value)
      + certificate_pem              = (known after apply)
      + certificate_url              = (known after apply)
      + common_name                  = "*.foreignlanguagereader.com"
      + disable_complete_propagation = false
      + id                           = (known after apply)
      + issuer_pem                   = (known after apply)
      + key_type                     = "2048"
      + min_days_remaining           = 30
      + must_staple                  = false
      + private_key_pem              = (sensitive value)

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "digitalocean"
        }
    }

  # module.infrastructure.acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "letsencrypt@lucaskjaerozhang.com"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # module.infrastructure.digitalocean_domain.main will be created
  + resource "digitalocean_domain" "main" {
      + id   = (known after apply)
      + name = "foreignlanguagereader.com"
      + urn  = (known after apply)
    }

  # module.infrastructure.kubernetes_ingress.foreign_language_reader_ingress will be created
  + resource "kubernetes_ingress" "foreign_language_reader_ingress" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class"             = "nginx"
              + "nginx.ingress.kubernetes.io/enable-cors" = "true"
            }
          + generation       = (known after apply)
          + name             = "foreign-language-reader-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "api.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "api"
                          + service_port = "4000"
                        }
                    }
                }
            }
          + rule {
              + host = "kibana.foreignlanguagereader.com"

              + http {
                  + path {
                      + backend {
                          + service_name = "kibana-kibana"
                          + service_port = "5601"
                        }
                    }
                }
            }

          + tls {
              + secret_name = "nginx-certificate"
            }
        }
    }

  # module.infrastructure.kubernetes_namespace.prod will be created
  + resource "kubernetes_namespace" "prod" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "prod"
            }
          + generation       = (known after apply)
          + name             = "prod"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.kubernetes_namespace.qa will be created
  + resource "kubernetes_namespace" "qa" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "qa"
            }
          + generation       = (known after apply)
          + name             = "qa"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.tls_private_key.tls_private_key will be created
  + resource "tls_private_key" "tls_private_key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.infrastructure.module.container_registries.digitalocean_container_registry.api_registry will be created
  + resource "digitalocean_container_registry" "api_registry" {
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + name                   = "foreign-language-reader-api"
      + server_url             = (known after apply)
      + subscription_tier_slug = "starter"
    }

  # module.infrastructure.module.content.helm_release.spark will be created
  + resource "helm_release" "spark" {
      + atomic                     = false
      + chart                      = "sparkoperator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "spark"
      + namespace                  = "content"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "http://storage.googleapis.com/kubernetes-charts-incubator"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.6.9"
      + wait                       = true
    }

  # module.infrastructure.module.content.kubernetes_namespace.content will be created
  + resource "kubernetes_namespace" "content" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "content"
            }
          + generation       = (known after apply)
          + name             = "content"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be created
  + resource "digitalocean_record" "kubernetes_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kibana"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.2.2"
      + wait                       = true
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
